"""
Задача 32: Определить индексы элементов массива (списка), 
значения которых принадлежат заданному диапазону 
(т.е. не меньше заданного минимума и не больше заданного максимума)

Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7] 
7 
10 

Вывод: [1, 9, 13, 14, 19]
"""

start_list = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7] 
min_value = 7
max_value = 10
result_list = []

for i in range(len(start_list)):
    if min_value <= start_list[i] <= max_value:
        result_list.append(i)
print(result_list)